{"type": "interaction", "interaction_id": "fa7dd784-6d74-409a-a60d-6e965a280e7a", "session_id": "06c9340c-fa82-4452-8b4b-b750cbfdebd5", "timestamp": "2025-12-02T03:44:19.318777", "question": "Oi", "response": "Olá! Como posso ajudar você hoje? Se tiver alguma dúvida sobre leis trabalhistas ou qualquer outro assunto jurídico, estou aqui para auxiliar.", "context": [], "feedback": null}
{"type": "interaction", "interaction_id": "dca9935e-7ea2-4d56-846e-4ccf759aeca9", "session_id": "06c9340c-fa82-4452-8b4b-b750cbfdebd5", "timestamp": "2025-12-02T03:44:46.959573", "question": "como estás?", "response": "Estou bem, obrigado por perguntar! E você, como está? Se tiver alguma questão jurídica em mente, fique à vontade para compartilhar. Estou aqui para ajudar.", "context": [], "feedback": null}
{"type": "interaction", "interaction_id": "951ddcdc-8de2-4cbe-b52a-65f4e8788451", "session_id": "06c9340c-fa82-4452-8b4b-b750cbfdebd5", "timestamp": "2025-12-02T03:46:35.431155", "question": " \"Gestantes têm estabilidade no emprego?\"", "response": "Sim, gestantes têm estabilidade no emprego conforme previsto na CLT. O Art. 391-A da CLT garante estabilidade provisória à empregada gestante, desde a confirmação da gravidez até o término do período de estabilidade, que é de cinco meses após o parto, conforme a alínea \"b\" do inciso II do art. 10 do Ato das Disposições Constitucionais Transitórias. Essa estabilidade é assegurada mesmo que a gravidez ocorra durante o aviso prévio, trabalhado ou indenizado. Fonte: CLT, Art. 391-A.", "context": [], "feedback": null}
{"type": "interaction", "interaction_id": "9bc410ef-32b3-48a6-80de-e9b6970ea3cc", "session_id": "1a150a9f-35b3-4120-a027-722ffee2bfc2", "timestamp": "2025-12-05T18:14:53.639606", "question": "Olá, como vc tá?", "response": "Olá! Estou bem, obrigado por perguntar. Estou aqui para ajudar com qualquer dúvida que você tenha sobre leis trabalhistas. Como posso auxiliar você hoje?", "context": [], "feedback": null}
{"type": "interaction", "interaction_id": "21bd72d5-85ed-42f6-a88c-9b741b46fe7e", "session_id": "1a150a9f-35b3-4120-a027-722ffee2bfc2", "timestamp": "2025-12-05T18:16:39.576682", "question": "Tenho que pagar multa do FGTS mesmo em justa causa?", "response": "Em caso de demissão por justa causa, o empregado não tem direito à multa do FGTS. Conforme o Art. 482 da CLT (Decreto-Lei no 5.452/1943), a rescisão do contrato de trabalho por justa causa pode ocorrer por diversos motivos, como ato de improbidade, incontinência de conduta, negociação habitual sem permissão, condenação criminal, desídia, embriaguez habitual, entre outros. Nessas circunstâncias, o empregado perde o direito à multa rescisória sobre o FGTS, que é devida apenas em casos de dispensa sem justa causa, conforme o Art. 2o do mesmo diploma legal, que trata do seguro-desemprego.", "context": [], "feedback": null}
{"type": "interaction", "interaction_id": "971acb8c-2177-4300-be76-338b49b3d259", "session_id": "1a150a9f-35b3-4120-a027-722ffee2bfc2", "timestamp": "2025-12-05T18:21:28.695141", "question": "O que fala o artigo Art. 452-D e o quais sugestões de prevencao vc pode fornecer?", "response": "Não encontrei informações sobre o artigo Art. 452-D na CLT ou nas normas fornecidas. Poderia reformular sua dúvida?", "context": [], "feedback": null}
{"type": "interaction", "interaction_id": "a3d89b75-a3d4-4acf-921a-7085341b46b3", "session_id": "1a150a9f-35b3-4120-a027-722ffee2bfc2", "timestamp": "2025-12-05T18:22:18.252134", "question": "Mas, vc não tem ele na base de conhecimnento?", "response": "O aviso prévio na CLT é concedido na proporção de 30 dias para empregados com até 1 ano de serviço na mesma empresa, conforme o Art. 1o do Decreto-Lei no 5.452/1943. Além disso, são acrescidos 3 dias por ano de serviço, até um máximo de 90 dias. Fonte: Art. 1o, CLT (Decreto-Lei no 5.452/1943).", "context": [], "feedback": null}
